console.log("Привет, мир!");

/* 
console - объект для работы с консолью вывода
console.log() - способ вывода данных в консоль
типы данных - множества доступных значений языка
инструкции и операторы - команды языка 
переменные - величины которые могут менять значения
let const var - операторы создания переменных и констант
выражение - корректный код, возвращающий значение

Переводы слов с англ.:
log - журнал
const - константа
let - позволять
string - строка
number - число
boolean - логический
undefined - неопределенный
null - пустой

string 'John' "Smith " `Doe`
number 100000 36.6 1e5 1e-5
boolean true false
undefined undefined
null null
object {name: 'John'} [12,23,34] function(){}
bigint 100n
symbol

let firstName = 'Алексей';
firstName = "Алексей Тарасов";
console.log(firstName);

const ASC = 'ASC';
const STONE = 'камень';
console.log(ASC);
console.log(STONE);
*/

// Выведите в консоль строку 'мир'
// Выведите в консоль число 100
// Выведите в консоль булево значение true
// Выведите в консоль значение undefined
// Выведите в консоль своё имя
// Выведите в консоль вес своего кота

// Создайте константу COPYRIGHT со значением 2022
// Создайте переменную pricePerHour с стоимостью часа работы
// Создайте переменную firstName со своим именем
// Создайте переменную isChecked с булевым значением true
// Выведите значения переменных
