/*
Переводы слов с англ.:
if - если
else - иначе
ternary - троичный
salary - заработная плата :)
*/

let salary = 30000;

if (salary < 75000) {
  console.log("Учиться!");
} else {
  console.log("Работать");
}

//тернарный оператор
let res = salary < 75000 ? "Учиться!" : "Работать";
console.log(res);

// Есть переменная color='red'. При помощи if определить, является ли значение переменной равной 'red' и, если является, вывести слово "красный", а иначе "не красный"
// Есть переменные m, h с произвольными значениями. Найти индекс массы тела  I и вывести фразу "спортзал ждёт нас" или "съешь булок"
